app/views/users/show.html.erb

    <%= render 'follow_form' if logged_in? %>
    <% if @user.microposts.any? %>
---
SELECT  1 AS one FROM `microposts` WHERE `microposts`.`user_id` = 8 LIMIT 1