app/controllers/password_resets_controller.rb

  def create
    @user = User.find_by(email: params[:password_reset][:email].downcase)
---
SELECT  `users`.* FROM `users` WHERE `users`.`email` = 'tuyetsonfutu@gmail.com' LIMIT 1

  def update
    if params[:user][:password].empty?
      flash.now[:danger] = "Password can't be empty"
      render 'edit'
    elsif @user.update_attributes(user_params)
---
UPDATE `users` SET `password_digest` = '$2a$10$lEJfu6o.nzOTgYcaLfrWX.MbPJPnAWIekOysRc6vz8RWuWKIS1y3y', `updated_at` = '2015-07-16 08:03:42' WHERE `users`.`id` = 108