app/controllers/users_controller.rb

  def index
    @users = User.paginate(page: params[:page])
---
SELECT  `users`.* FROM `users` LIMIT 30 OFFSET 0
SELECT COUNT(*) FROM `users`

  def show
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` IS NULL LIMIT 1

  def create
    @user = User.new(user_params)
    if @user.save
---
INSERT INTO `users` (`name`, `email`, `password_digest`, `created_at`, `updated_at`, `activation_digest`) VALUES ('user', 'user@example.com', '$2a$10$WuFgBpBC4pMaIK4iSGn0vuE1ZSnWOuDQkXBJV.m8uEhCQaLVduWoa', '2015-07-15 08:09:21', '2015-07-15 08:09:21', '$2a$10$UatTQ35y6y5jaEYbcUKPbuj8iGh8RWNizcX7o9L.gR6drVZZ6BXti')

  def edit
    @user = User.find(params[:id])
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1

  def update
    @user = User.find(params[:id])
    if @user.update_attributes(user_params)
---
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 3 LIMIT 1
UPDATE `users` SET `name` = 'momo', `email` = 'momo@gmail.com', `password_digest` = '$2a$10$SS9Lm28p.ThtvdI13cM6Ne9xNNFiYUexoeqGAn2tnAyjEPXB3CcLO', `updated_at` = '2015-07-15 02:04:29' WHERE `users`.`id` = 1

  def destroy
    User.find(params[:id]).destroy
---
DELETE FROM `users` WHERE `users`.`id` = 2
SELECT  `users`.* FROM `users` WHERE `users`.`id` = 1 LIMIT 1